#Область ПрограммныйИнтерфейс

// Возвращает выборку товаров документа сгруппированных по Номенклатуре
// Параметры:
//  документСсылка - ДокументСсылка.ВыпускГотовойПродукции
//  выгрузить - Булево - Если Истина результат запроса будет выгружен в `ТаблицуЗначений`
// Возвращаемое значение:
//  - ВыборкаИзРезультатаЗапроса
//  - ТаблицаЗначений
//      * Номенклатура - СправочникСсылка.Номенклатура
//      * Количество - Число
//  - Неопределено - Если таблица не заполнена
Функция ПолучитьТоварыДокумента(Знач документСсылка, Знач выгрузить = Истина) Экспорт
    запросТовары = Новый Запрос;
    запросТовары.УстановитьПараметр("Ссылка", документСсылка);
    запросТовары.Текст =
        "ВЫБРАТЬ
        |	ВыпускГотовойПродукции.Номенклатура КАК Номенклатура,
        |	СУММА(ВыпускГотовойПродукции.Количество) КАК Количество
        |ИЗ
        |	Документ.ВыпускГотовойПродукции.Товары КАК ВыпускГотовойПродукции
        |ГДЕ
        |	ВыпускГотовойПродукции.Ссылка = &Ссылка
        |
        |СГРУППИРОВАТЬ ПО
        |	ВыпускГотовойПродукции.Номенклатура
        |";

    результатЗапроса = запросТовары.Выполнить();
    Если результатЗапроса.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;

    Если выгрузить = Истина Тогда
        Возврат результатЗапроса.Выгрузить();
    Иначе
        Возврат результатЗапроса.Выбрать();
    КонецЕсли;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
